'''
백준 2869 [달팽이는 올라가고 싶다]
땅 위에 달팽이가 있다. 이 달팽이는 높이가 V미터인 나무 막대를 올라갈 것이다.
달팽이는 낮에 A미터 올라갈 수 있다. 하지만, 밤에 잠을 자는 동안 B미터 미끄러진다. 또, 정상에 올라간 후에는 미끄러지지 않는다.
달팽이가 나무 막대를 모두 올라가려면, 며칠이 걸리는지 구하는 프로그램을 작성하시오.
첫째 줄에 세 정수 A, B, V가 공백으로 구분되어서 주어진다. (1 ≤ B < A ≤ V ≤ 1,000,000,000)
'''

# A, B, V = 2, 1, 5 # test case
# '''시간초과'''
# A, B, V = map(int, input().split())
# N = 1
# while True:
#     V -= A
#     if V <= 0 : break
#     N += 1
#     V += B
#     if V <= 0 : break
# print(N)

'''
다른 방법
나무 높이 : V = (A-B)*N + A
(마지막날에 낮에 올라가는 길이인 A 더해주기)
N = (V-A)/(A-B)
소수점은 올림처리! 날짜가 지난 것으로 간주함
math.ceil : 반올림하는 함수
'''
import math
A, B, V = map(int, input().split())
print(math.ceil((V-A)/(A-B)) + 1)